[
    
    {
        "id": "0",
        "dua": "رَبَّنَا لاَ تُزِغْ قُلُوبَنَا بَعْدَ إِذْ هَدَيْتَنَا وَهَبْ لَنَا مِن لَّدُنكَ رَحْمَةً إِنَّكَ أَنتَ الْوَهَّابُ",
        "translation": "Our Lord! Let not our hearts deviate (from the truth) after You have guided us, and grant us mercy from You. Truly, You are the Bountiful Giver.",
        "reference": "Surah Aal-'Imran (3:8)",
        "audios": [
            "https://cdn.islamic.network/quran/audio/128/ar.alafasy/301.mp3"
        ]
    },

  
    {
        "id": "1",
        "dua": "رَّبَّنَا إِنَّنَا سَمِعْنَا مُنَادِيًا يُنَادِي لِلإِيمَانِ أَنْ آمِنُواْ بِرَبِّكُمْ فَآمَنَّا رَبَّنَا فَاغْفِرْ لَنَا ذُنُوبَنَا وَكَفِّرْ عَنَّا سَيِّئَاتِنَا وَتَوَفَّنَا مَعَ الأبْرَارِ",
        "translation": "Our Lord, indeed we have heard a caller calling to faith, [saying], 'Believe in your Lord,' and we have believed. So forgive us our sins, Our Lord, and remove from us our misdeeds and and make us die the death of the righteous.",
        "reference": "Surah Aal-'Imran (3:193)",
        "audios": [
            "https://cdn.islamic.network/quran/audio/128/ar.alafasy/486.mp3"
        ]
    },
  
    {
        "id": "2",
        "dua": "رَبِّ اشْرَحْ لِي صَدْرِي وَيَسِّرْ لِي أَمْرِي وَاحْلُلْ عُقْدَةً مِّن لِّسَانِي  يَفْقَهُوا قَوْلِي",
        "translation": "O my Lord! Widen for me my bossom (grant me self-confidence, contentment, and boldness); And ease my task for me; And make loose the knot (i.e. the defect restricting speech) from my tongue; So they may understand what I say",
        "reference": "Surah TaHa (20:25-28) ",
        "audios": [
            "https://cdn.islamic.network/quran/audio/128/ar.alafasy/2373.mp3",
            "https://cdn.islamic.network/quran/audio/128/ar.alafasy/2376.mp3"
        ]
    },
   
    {
        "id": "3",
        "dua": "وَإِذْ يَرْفَعُ إِبْرَٰهِۦمُ ٱلْقَوَاعِدَ مِنَ ٱلْبَيْتِ وَإِسْمَٰعِيلُ رَبَّنَا تَقَبَّلْ مِنَّآ إِنَّكَ أَنتَ ٱلسَّمِيعُ ٱلْعَلِيم",
        "translation": "And [mention] when Abraham was raising the foundations of the House and [with him] Ishmael, [saying], \"Our Lord, accept [this] from us. Indeed You are the Hearing, the Knowing.",
        "reference": "Surah Al-Baqara (2:127)",
        "audios": [
            "https://cdn.islamic.network/quran/audio/128/ar.alafasy/134.mp3"
        ]
    },
    {
        "id": "4",
        "dua": "رَبَّنَا وَٱجْعَلْنَا مُسْلِمَيْنِ لَكَ وَمِن ذُرِّيَّتِنَآ أُمَّةً مُّسْلِمَةً لَّكَ وَأَرِنَا مَنَاسِكَنَا وَتُبْ عَلَيْنَآ إِنَّكَ أَنتَ ٱلتَّوَّابُ ٱلرَّحِيمُ",
        "translation": "Our Lord, and make us Muslims [in submission] to You and from our descendants a Muslim nation [in submission] to You. And show us our rites and accept our repentance. Indeed, You are the Accepting of repentance, the Merciful.",
        "reference": "Surah Al-Baqara (2:128)",
        "audios": [
            "https://cdn.islamic.network/quran/audio/128/ar.alafasy/135.mp3"
        ]
    },
    {
        "id": "5",
        "dua": "رَبَّنَآ ءَاتِنَا فِى ٱلدُّنْيَا حَسَنَةً وَفِى ٱلْءَاخِرَةِ حَسَنَةً وَقِنَا عَذَابَ ٱلنَّارُ",
        "translation": "Our Lord, give us in this world [that which is] good and in the Hereafter [that which is] good and protect us from the punishment of the Fire.",
        "reference": "Surah Al-Baqara (2:201)",
        "audios": [
            "https://cdn.islamic.network/quran/audio/128/ar.alafasy/208.mp3"
        ]
    },
   
    {
        "id": "6",
        "dua": "رَبَّنَآ إِنَّكَ جَامِعُ ٱلنَّاسِ لِيَوْمٍ لَّا رَيْبَ فِيهِ إِنَّ ٱللَّهَ لَا يُخْلِفُ ٱلْمِيعَادُ",
        "translation": "Our Lord, surely You will gather the people for a Day about which there is no doubt. Indeed, Allah does not fail in His promise.\"",
        "reference": "Surah Aal-'Imran (3:9)",
        "audios": [
            "https://cdn.islamic.network/quran/audio/128/ar.alafasy/302.mp3"
        ]
    },
  
    {
        "id": "7",
        "dua": "رَبَّنَآ ءَامَنَّا بِمَآ أَنزَلْتَ وَٱتَّبَعْنَا ٱلرَّسُولَ فَٱكْتُبْنَا مَعَ ٱلشَّٰهِدِينَُِ",
        "translation": "Our Lord, we have believed in what You revealed and have followed the messenger Jesus, so register us among the witnesses [to truth].\"",
        "reference": "Surah Aal-'Imran (3:53)",
        "audios": [
            "https://cdn.islamic.network/quran/audio/128/ar.alafasy/346.mp3"
        ]
    },
    {
        "id": "8",
        "dua": "رَبَّنَا مَا خَلَقْتَ هَٰذَا بَٰطِلًا سُبْحَٰنَكَ فَقِنَا عَذَابَ ٱلنَّارَُِ",
        "translation": "Our Lord, You did not create this aimlessly; exalted are You [above such a thing]; then protect us from the punishment of the Fire.",
        "reference": "Surah Aal-'Imran (3:191)",
        "audios": [
            "https://cdn.islamic.network/quran/audio/128/ar.alafasy/484.mp3"
        ]
    },
    {
        "id": "9",
        "dua": "رَبَّنَآ إِنَّكَ مَن تُدْخِلِ ٱلنَّارَ فَقَدْ أَخْزَيْتَهُۥ وَمَا لِلظَّٰلِمِينَ مِنْ أَنصَارَُِ",
        "translation": "Our Lord, indeed whoever You admit to the Fire - You have disgraced him, and for the wrongdoers there are no helpers.",
        "reference": "Surah Aal-'Imran (3:192)",
        "audios": [
            "https://cdn.islamic.network/quran/audio/128/ar.alafasy/485.mp3"
        ]
    },
    {
        "id": "10",
        "dua": "رَّبَّنَآ إِنَّنَا سَمِعْنَا مُنَادِيًا يُنَادِى لِلْإِيمَٰنِ أَنْ ءَامِنُوا۟ بِرَبِّكُمْ فَـَٔامَنَّا رَبَّنَا فَٱغْفِرْ لَنَا ذُنُوبَنَا وَكَفِّرْ عَنَّا سَيِّـَٔاتِنَا وَتَوَفَّنَا مَعَ ٱلْأَبْرَارَُِ",
        "translation": "Our Lord, indeed we have heard a caller calling to faith, [saying], 'Believe in your Lord,' and we have believed. Our Lord, so forgive us our sins and remove from us our misdeeds and cause us to die with the righteous.",
        "reference": "Surah Aal-'Imran (3:193)",
        "audios": [
            "https://cdn.islamic.network/quran/audio/128/ar.alafasy/486.mp3"
        ]
    },
    {
        "id": "11",
        "dua": "رَبَّنَا وَءَاتِنَا مَا وَعَدتَّنَا عَلَىٰ رُسُلِكَ وَلَا تُخْزِنَا يَوْمَ ٱلْقِيَٰمَةِ إِنَّكَ لَا تُخْلِفُ ٱلْمِيعَادَُِ",
        "translation": "Our Lord, and grant us what You promised us through Your messengers and do not disgrace us on the Day of Resurrection. Indeed, You do not fail in [Your] promise.",
        "reference": "Surah Aal-'Imran (3:194)",
        "audios": [
            "https://cdn.islamic.network/quran/audio/128/ar.alafasy/487.mp3"
        ]
    },
    
    
    {
        "id": "12",
        "dua": "وَنَجِّنَا بِرَحْمَتِكَ مِنَ ٱلْقَوْمِ ٱلْكَٰفِرِينَ",
        "translation": "And save us by Your mercy from the disbelieving people.",
        "reference": "Surah Yunus (10:86)",
        "audios": [
            "https://cdn.islamic.network/quran/audio/128/ar.alafasy/1450.mp3"
        ]
    },
    {
        "id": "13",
        "dua": "رَبَّنَآ إِنَّكَ تَعْلَمُ مَا نُخْفِى وَمَا نُعْلِنُ وَمَا يَخْفَىٰ عَلَى ٱللَّهِ مِن شَىْءٍ فِى ٱلْأَرْضِ وَلَا فِى ٱلسَّمَآءَ",
        "translation": "Our Lord, indeed You know what we conceal and what we declare, and nothing is hidden from Allah on the earth or in the heaven.",
        "reference": "Surah Ibrahim (14:38)",
        "audios": [
            "https://cdn.islamic.network/quran/audio/128/ar.alafasy/1788.mp3"
        ]
    },
    {
        "id": "14",
        "dua": "رَبِّ اجْعَلْنِي مُقِيمَ الصَّلاَةِ وَمِن ذُرِّيَّتِي رَبَّنَا وَتَقَبَّلْ دُعَاء",
        "translation": "O my Lord! make me one who establishes Salah (regular Prayer), and also (raise such) among my offspring O our Lord! and accept my Prayer.",
        "reference": "Surah Ibrahim (14:40)",
        "audios": [
            "https://cdn.islamic.network/quran/audio/128/ar.alafasy/1790.mp3"
        ]
    },
    {
        "id": "15",
        "dua": "رَبَّنَا اغْفِرْ لِي وَلِوَالِدَيَّ وَلِلْمُؤْمِنِينَ يَوْمَ يَقُومُ الْحِسَابُ",
        "translation": "Our Lord! Forgive me and my parents, and (all) the believers on the Day when the reckoning will be established.",
        "reference": " Surah Ibrahim (14:41)",
        "audios": [
            "https://cdn.islamic.network/quran/audio/128/ar.alafasy/1791.mp3"
        ]
    },
    
    {
        "id": "16",
        "dua": "إِنَّهَا سَآءَتْ مُسْتَقَرًّا وَمُقَامًا",
        "translation": "Indeed, it is evil as a settlement and residence.",
        "reference": "Surah Al-Furqaan (25:66)",
        "audios": [
            "https://cdn.islamic.network/quran/audio/128/ar.alafasy/2921.mp3"
        ]
    },
   
    {
        "id": "17",
        "dua": "رَبَّنَا وَأَدْخِلْهُمْ جَنَّاتِ عَدْنٍ الَّتِي وَعَدتَّهُم وَمَن صَلَحَ مِنْ آبَائِهِمْ وَأَزْوَاجِهِمْ وَذُرِّيَّاتِهِمْ إِنَّكَ أَنتَ الْعَزِيزُ الْحَكِيم",
        "translation": "Our Lord! And make them enter the Gardens of Eden [Paradise] which you have promised them, whoever was righteous among their fathers, their spouses and their offspring.  Indeed, You are the All-Mighty, the All-Wise.",
        "reference": "Surah Ghafir (40:8)",
        "audios": [
            "https://cdn.islamic.network/quran/audio/128/ar.alafasy/4141.mp3"
        ]
    }
    
]